app/Controllers/Api/CartApi.php

public function add()
{
    $userId = 1;

    $productId = $this->request->getPost('product_id');
    $quantity  = $this->request->getPost('quantity') ?? 1;

    // Check product exists
    $product = $this->productModel->find($productId);

    if (!$product) {
        return redirect()->back();
    }

    // Check if already in cart
    $existing = $this->cartModel
        ->where('user_id', $userId)
        ->where('product_id', $productId)
        ->first();

    if ($existing) {

        $this->cartModel->update($existing['id'], [
            'quantity' => $existing['quantity'] + $quantity
        ]);

    } else {

        $this->cartModel->insert([
            'user_id'    => $userId,
            'product_id' => $productId,
            'quantity'   => $quantity,
            'price'      => $product['price']
        ]);
    }

    // 🔥 CALCULATE TOTAL CART COUNT FROM DATABASE
    $totalQty = $this->cartModel
        ->where('user_id', $userId)
        ->selectSum('quantity')
        ->first()['quantity'] ?? 0;
---
SELECT *
FROM `products`
WHERE `products`.`id` = '5'
SELECT *
FROM `carts`
WHERE `user_id` = 1
AND `product_id` = '5'
 LIMIT 1
INSERT INTO `carts` (`user_id`, `product_id`, `quantity`, `price`) VALUES (1, '5', '1', '4499.00')
SELECT SUM(`quantity`) AS `quantity`
FROM `carts`
WHERE `user_id` = 1
 LIMIT 1

    public function update($id = null)
{
    $quantity = $this->request->getPost('quantity');

    if (!$quantity) {
        return redirect()->to(base_url('cart'));
    }

    $this->cartModel->update($id, [
        'quantity' => $quantity
    ]);

    $totalQty = $this->cartModel
        ->where('user_id', $this->userId)
        ->selectSum('quantity')
        ->first()['quantity'] ?? 0;
---
UPDATE `carts` SET `quantity` = '1'
WHERE `carts`.`id` IN ('18')
SELECT SUM(`quantity`) AS `quantity`
FROM `carts`
WHERE `user_id` = 1
 LIMIT 1

    public function delete($id = null)
{
    $this->cartModel->delete($id);

    // Recalculate cart count
    $totalQty = $this->cartModel
        ->where('user_id', $this->userId)
        ->selectSum('quantity')
        ->first()['quantity'] ?? 0;
---
DELETE FROM `carts`
WHERE `id` IN ('19')
SELECT SUM(`quantity`) AS `quantity`
FROM `carts`
WHERE `user_id` = 1
 LIMIT 1

    public function checkout()
{
    $userId = 1;

    $cartModel      = new \App\Models\CartModel();
    $orderModel     = new \App\Models\OrderModel();
    $orderItemModel = new \App\Models\OrderItemModel();
    $paymentModel   = new \App\Models\PaymentModel();

    $cartItems = $cartModel->where('user_id', $userId)->findAll();

    if (empty($cartItems)) {
        return $this->respond([
            'status' => false,
            'message' => 'Cart is empty'
        ]);
    }

    // Calculate total
    $totalAmount = 0;
    foreach ($cartItems as $item) {
        $totalAmount += $item['price'] * $item['quantity'];
    }

    // 1️⃣ Create Order
    $orderId = $orderModel->insert([
        'user_id' => $userId,
        'total_amount' => $totalAmount,
        'payment_status' => 'pending',
        'order_status' => 'placed'
    ]);

    // 2️⃣ Insert Order Items
    foreach ($cartItems as $item) {
        $orderItemModel->insert([
            'order_id' => $orderId,
            'product_id' => $item['product_id'],
            'quantity' => $item['quantity'],
            'price' => $item['price'],
            'subtotal' => $item['price'] * $item['quantity']
        ]);
---
SELECT *
FROM `carts`
WHERE `user_id` = 1
INSERT INTO `orders` (`user_id`, `total_amount`, `payment_status`, `order_status`) VALUES (1, 56298, 'pending', 'placed')
INSERT INTO `order_items` (`order_id`, `product_id`, `quantity`, `price`, `subtotal`) VALUES (13, '1', '1', '7919.00', 7919)

    ]);

    // 4️⃣ Clear Cart
    $cartModel->where('user_id', $userId)->delete();
---
DELETE FROM `carts`
WHERE `user_id` = 1