app/Controllers/Admin/Product.php

    public function index()
    {
        if (!session()->get('admin_logged_in')) {
            return redirect()->to('/admin/login');
        }

        $productModel = new ProductModel();
        $imageModel   = new ProductImageModel();

        $products = $productModel->findAll();

        foreach ($products as &$product) {
            $product['images'] = $imageModel
                ->where('product_id', $product['id'])
                ->findAll();
---
SELECT *
FROM `products`
SELECT *
FROM `product_images`
WHERE `product_id` = '1'