app/Controllers/CartPage.php

SELECT *
FROM `carts`
WHERE `user_id` = 1
SELECT *
FROM `products`
WHERE `products`.`id` = '1'
---
    public function index()
    {
        $cartModel = new CartModel();
        $productModel = new ProductModel();

        $cartItems = $cartModel->where('user_id',1)->findAll();

        foreach ($cartItems as &$item) {
            $product = $productModel->find($item['product_id']);