app/Controllers/Shop.php

SELECT *
FROM `products`
SELECT *
FROM `product_images`
WHERE `product_id` = '1'
---
    public function index()
    {
        $productModel = new ProductModel();
        $imageModel   = new ProductImageModel();

        $products = $productModel->findAll();

        foreach ($products as &$product) {
            $product['images'] = $imageModel
                ->where('product_id', $product['id'])
                ->findAll();